#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.aio_full.data.azurerm_resource_group.this: Reading...
data.azurerm_resource_group.this: Reading...
data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01]
module.aio_full.data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01]
module.aio_full.data.azurerm_key_vault.aio_kv: Reading...
module.aio_full.azurerm_arc_kubernetes_cluster_extension.aio: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/azure-iot-operations]
module.aio_full.data.azurerm_key_vault.aio_kv: Read complete after 1s [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.KeyVault/vaults/kv-catay-aio-01]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.assets[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/assets]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.mq[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/mq]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.layered_networking[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/layered-networking]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.akri[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/akri]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.processor[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/processor]
module.aio_full.azapi_resource.aio_custom_locations: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.ExtendedLocation/customLocations/cl-catay-aio-01-aio]
module.aio_full.azapi_resource.aio_custom_locations_sync: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.ExtendedLocation/customLocations/cl-catay-aio-01-aio/resourceSyncRules/cl-catay-aio-01-aio-sync]
module.aio_full.azapi_resource.processor_custom_locations_sync[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.ExtendedLocation/customLocations/cl-catay-aio-01-aio/resourceSyncRules/cl-catay-aio-01-aio-dp-sync]
module.aio_full.azapi_resource.aio_targets_main: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsOrchestrator/targets/catay-aio-01-tgt-main]
module.aio_full.azapi_resource.aio_targets_mq[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsOrchestrator/targets/catay-aio-01-tgt-mq]
module.aio_full.azapi_resource.aio_targets_opc_ua_broker[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsOrchestrator/targets/catay-aio-01-tgt-oub]
module.aio_full.azapi_resource.aio_targets_opc_ua_broker_trust[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsOrchestrator/targets/catay-aio-01-tgt-oub-trust]
module.aio_full.azapi_resource.processor_instances[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsDataProcessor/instances/dp-catay-aio-01]
module.aio_full.azapi_resource.mq_custom_locations_sync[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.ExtendedLocation/customLocations/cl-catay-aio-01-aio/resourceSyncRules/cl-catay-aio-01-aio-mq-sync]
module.aio_full.azapi_resource.adr_custom_locations_sync[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.ExtendedLocation/customLocations/cl-catay-aio-01-aio/resourceSyncRules/cl-catay-aio-01-aio-adr-sync]
module.aio_full.azapi_resource.mq[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsMQ/mq/mq-catay-aio-01]
module.aio_full.azapi_resource.mq_diagnostics[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsMQ/mq/mq-catay-aio-01/diagnosticService/mq-catay-aio-01-dia]
module.aio_full.azapi_resource.mq_broker[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsMQ/mq/mq-catay-aio-01/broker/mq-catay-aio-01-bk]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.opc_ua_broker[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.Kubernetes/connectedClusters/arc-catay-aio-01/providers/Microsoft.KubernetesConfiguration/extensions/opc-ua-broker]
module.aio_full.azapi_resource.mq_broker_listener[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsMQ/mq/mq-catay-aio-01/broker/mq-catay-aio-01-bk/listener/mq-catay-aio-01-bk-lis]
module.aio_full.azapi_resource.mq_broker_auth[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsMQ/mq/mq-catay-aio-01/broker/mq-catay-aio-01-bk/authentication/mq-catay-aio-01-bk-aut]
module.opc_plc_sim.data.azurerm_resource_group.this: Reading...
module.opc_plc_sim.data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01]
module.opc_plc_sim.azapi_resource.aio_targets_mqtt_client[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsOrchestrator/targets/catay-aio-01-tgt-mc]
module.opc_plc_sim.azapi_resource.aio_targets_opc_plc_sim[0]: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.IoTOperationsOrchestrator/targets/catay-aio-01-tgt-sim]
module.opc_plc_sim.azapi_resource.opc_sim_aep: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.DeviceRegistry/assetEndpointProfiles/opc-sim-connector]
module.opc_plc_sim.azapi_resource.opc_sim_asset: Refreshing state... [id=/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.DeviceRegistry/assets/thermostat]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.local_client will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "local_client" {
      + certificates = (known after apply)
      + content      = (known after apply)
      + id           = (known after apply)
    }

  # data.tls_certificate.root_ca_cert_pem will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "root_ca_cert_pem" {
      + certificates = (known after apply)
      + content      = (known after apply)
      + id           = (known after apply)
    }

  # azapi_resource.aio_targets_cluster will be created
  + resource "azapi_resource" "aio_targets_cluster" {
      + body                      = jsonencode(
            {
              + extendedLocation = {
                  + name = "/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01/providers/Microsoft.ExtendedLocation/customLocations/cl-catay-aio-01-aio"
                  + type = "CustomLocation"
                }
              + properties       = {
                  + components = [
                      + {
                          + name       = "egmq-mqtt-bridge-connector"
                          + properties = {
                              + resource = {
                                  + apiVersion = "mq.iotoperations.azure.com/v1beta1"
                                  + kind       = "MqttBridgeConnector"
                                  + metadata   = {
                                      + name = "egmq-mqtt-bridge"
                                    }
                                  + spec       = {
                                      + bridgeInstances        = 1
                                      + clientIdPrefix         = "aio-mq-"
                                      + image                  = {
                                          + pullPolicy = "IfNotPresent"
                                          + repository = "mcr.microsoft.com/azureiotoperations/mqttbridge"
                                          + tag        = "0.1.0-preview"
                                        }
                                      + localBrokerConnection  = {
                                          + authentication = {
                                              + kubernetes = {}
                                            }
                                          + endpoint       = "aio-mq-dmqtt-frontend:8883"
                                          + tls            = {
                                              + tlsEnabled                    = true
                                              + trustedCaCertificateConfigMap = "aio-ca-trust-bundle-test-only"
                                            }
                                        }
                                      + logLevel               = "debug"
                                      + protocol               = "v5"
                                      + remoteBrokerConnection = {
                                          + authentication = {
                                              + systemAssignedManagedIdentity = {
                                                  + audience = "https://eventgrid.azure.net"
                                                }
                                            }
                                          + endpoint       = "eg-catay-aio-01.westus3-1.ts.eventgrid.azure.net:8883"
                                          + tls            = {
                                              + tlsEnabled = true
                                            }
                                        }
                                    }
                                }
                            }
                          + type       = "yaml.k8s"
                        },
                      + {
                          + name       = "egmq-mqtt-bridge-topic-map"
                          + properties = {
                              + resource = {
                                  + apiVersion = "mq.iotoperations.azure.com/v1beta1"
                                  + kind       = "MqttBridgeTopicMap"
                                  + metadata   = {
                                      + name = "egmq-topic-map"
                                    }
                                  + spec       = {
                                      + mqttBridgeConnectorRef = "egmq-mqtt-bridge"
                                      + routes                 = [
                                          + {
                                              + direction = "remote-to-local"
                                              + name      = "cloud-to-edge"
                                              + qos       = 1
                                              + source    = "cloud/edge/#"
                                              + target    = "cloud/data"
                                            },
                                          + {
                                              + direction = "local-to-remote"
                                              + name      = "edge-to-cloud"
                                              + qos       = 1
                                              + source    = "azure-iot-operations/data/#"
                                              + target    = "edge/cloud/data"
                                            },
                                        ]
                                    }
                                }
                            }
                          + type       = "yaml.k8s"
                        },
                    ]
                  + scope      = "azure-iot-operations"
                  + topologies = [
                      + {
                          + bindings = [
                              + {
                                  + config   = {
                                      + inCluster = "true"
                                    }
                                  + provider = "providers.target.kubectl"
                                  + role     = "yaml.k8s"
                                },
                              + {
                                  + config   = {
                                      + inCluster = "true"
                                    }
                                  + provider = "providers.target.helm"
                                  + role     = "helm.v3"
                                },
                            ]
                        },
                    ]
                  + version    = "1.0.0"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westus3"
      + name                      = "cluster"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01"
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + tags                      = (known after apply)
      + type                      = "Microsoft.IoTOperationsOrchestrator/targets@2023-10-04-preview"
    }

  # azapi_resource.egmq will be created
  + resource "azapi_resource" "egmq" {
      + body                      = jsonencode(
            {
              + identity   = {
                  + type = "SystemAssigned"
                }
              + properties = {
                  + topicSpacesConfiguration = {
                      + clientAuthentication                       = {
                          + alternativeAuthenticationNameSources = [
                              + "ClientCertificateSubject",
                            ]
                        }
                      + maximumClientSessionsPerAuthenticationName = 5
                      + maximumSessionExpiryInHours                = 1
                      + state                                      = "Enabled"
                    }
                }
              + sku        = {
                  + capacity = 5
                  + name     = "Standard"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westus3"
      + name                      = "eg-catay-aio-01"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/292ace73-dbcc-4653-8ba6-9c265f0d7d90/resourceGroups/rg-catay-aio-01"
      + removing_special_chars    = false
      + response_export_values    = [
          + "properties.topicSpacesConfiguration.hostname",
        ]
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.EventGrid/namespaces@2023-12-15-preview"
    }

  # azapi_resource.egmq_permission_bindings_subscriber will be created
  + resource "azapi_resource" "egmq_permission_bindings_subscriber" {
      + body                      = jsonencode(
            {
              + properties = {
                  + clientGroupName = "$all"
                  + permission      = "Subscriber"
                  + topicSpaceName  = "aio"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "aio-subscriber"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.EventGrid/namespaces/permissionBindings@2023-12-15-preview"
    }

  # azapi_resource.egmq_topic_spaces will be created
  + resource "azapi_resource" "egmq_topic_spaces" {
      + body                      = jsonencode(
            {
              + properties = {
                  + topicTemplates = [
                      + "edge/cloud/#",
                      + "cloud/edge/#",
                    ]
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "aio"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.EventGrid/namespaces/topicSpaces@2023-12-15-preview"
    }

  # azapi_resource.event_grid_local_client will be created
  + resource "azapi_resource" "event_grid_local_client" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "local-client"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.EventGrid/namespaces/clients@2023-12-15-preview"
    }

  # azapi_resource.event_grid_permission_binding_publisher will be created
  + resource "azapi_resource" "event_grid_permission_binding_publisher" {
      + body                      = jsonencode(
            {
              + properties = {
                  + clientGroupName = "$all"
                  + permission      = "Publisher"
                  + topicSpaceName  = "aio"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "aio-publisher"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.EventGrid/namespaces/permissionBindings@2023-12-15-preview"
    }

  # azurerm_role_assignment.aio_mq_eg_topicspaces_publisher will be created
  + resource "azurerm_role_assignment" "aio_mq_eg_topicspaces_publisher" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "56ad1654-7c7c-4f6c-8c3e-adf0d977ea05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "EventGrid TopicSpaces Publisher"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aio_mq_eg_topicspaces_subscriber will be created
  + resource "azurerm_role_assignment" "aio_mq_eg_topicspaces_subscriber" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "56ad1654-7c7c-4f6c-8c3e-adf0d977ea05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "EventGrid TopicSpaces Subscriber"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # local_sensitive_file.local_client_cert_pem will be created
  + resource "local_sensitive_file" "local_client_cert_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localca.pem"
      + id                   = (known after apply)
    }

  # local_sensitive_file.local_client_key_pem will be created
  + resource "local_sensitive_file" "local_client_key_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localca.key"
      + id                   = (known after apply)
    }

  # local_sensitive_file.root_ca_cert_pem will be created
  + resource "local_sensitive_file" "root_ca_cert_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localrootca.pem"
      + id                   = (known after apply)
    }

  # local_sensitive_file.root_ca_key_pem will be created
  + resource "local_sensitive_file" "root_ca_key_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localrootca.key"
      + id                   = (known after apply)
    }

  # tls_cert_request.local_client will be created
  + resource "tls_cert_request" "local_client" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name = "LocalCA"
        }
    }

  # tls_locally_signed_cert.local_client will be created
  + resource "tls_locally_signed_cert" "local_client" {
      + allowed_uses          = [
          + "crl_signing",
          + "client_auth",
          + "digital_signature",
          + "content_commitment",
          + "key_encipherment",
          + "key_agreement",
          + "email_protection",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = (known after apply)
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + ready_for_renewal     = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8076
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.local_client will be created
  + resource "tls_private_key" "local_client" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_private_key.root_ca_key will be created
  + resource "tls_private_key" "root_ca_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.root_ca_cert will be created
  + resource "tls_self_signed_cert" "root_ca_cert" {
      + allowed_uses          = [
          + "crl_signing",
          + "client_auth",
          + "cert_signing",
          + "digital_signature",
          + "content_commitment",
          + "key_encipherment",
          + "key_agreement",
          + "email_protection",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = true
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8076
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = "LocalRootCA"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + egmq_hostname = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @catay7818, Action: `pull_request`, Working Directory: ``, Workflow: `CI Pull Request`*